{"meta":{"title":"Next Station","subtitle":null,"description":"On The Road","author":"YANG/MOMO","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"姑娘,你的愿望还真是美好","slug":"姑娘你的愿望还真是美好","date":"2016-04-25T12:59:00.000Z","updated":"2016-04-25T13:40:18.000Z","comments":true,"path":"2016/04/25/姑娘你的愿望还真是美好/","link":"","permalink":"http://yoursite.com/2016/04/25/姑娘你的愿望还真是美好/","excerpt":"","keywords":null,"text":"&ensp;&ensp;&ensp;&ensp;阳光底下无新事&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;－－题记 &ensp;&ensp;&ensp;&ensp;「你一定要好好和我说话，要夸我，不要骂我。吃软不吃硬的我，不是那种越挫越勇的人，如果你对我有意见，可以先说”我觉得你好棒”，然后再说”但是”——“如果你改一改你的小毛病会变得更好”」当我把这段来自《下一站：那不勒斯》里琉玄说的话发给羊的时候，他立刻回了一句 “宝宝你好棒，要是出去转转就更好了”。磨蹭了一个小时后，我终于懒散的出门了。因为眼睛受伤的缘故，隐形不能戴了，索性就擦了防晒霜，穿了羊的卫衣，出了门。在日本人堆里，不修边幅的我反而夺目了。日本女生是那种任何情况下，都有一张经过化妆品修饰过的精致的脸，据说不化妆就不会出门，即使是倒垃圾。相比之下，我应该属于重度懒癌患者，很多时候护肤品也不抹，顶着一张干燥粗糙的脸，横冲直撞。&ensp;&ensp;&ensp;&ensp;外面阳光很好，洒在眼皮上，就像热腾腾的牛奶巧克力。每天下午我坐在格格不入的办公室里，都会想，离开这里的时候，会不会怀念每天下午五点准时出现的垃圾车的音乐。此时此刻又加了一抹记忆：电车离去时拉长的身躯。到站，开走。你好，再见。同时发生。&ensp;&ensp;&ensp;&ensp;我总是会思考很多，和自己有关的，譬如说以后该何去何从，是从容的老去，还是拼劲全力奋斗一生；我是不是对羊太苛刻，数落他的时候，他就像一只温顺的绵羊，让我越说越想欺负他。顺便说一句，我是典型的完美主义着，宽以律己，严以律人的完美主义者。当然，更多的是胡思乱想，距离自己生活很远很远的事：美国的大选、宠物收容所为什么要杀掉那些没有被领养的动物、酱油学校开学了吗。用一句俗语说我这类人就是咸吃萝卜淡操心。&ensp;&ensp;&ensp;&ensp;我的记忆力最近几年急剧下降。不得不担忧有提前进入老年痴呆的征兆。也许是因为麻药打多了。我对橙子说。‘你都打什么麻药了’‘拔牙啊，我拔了好几个智齿’‘拔牙是局部麻醉’‘不，我打的是全麻…哦对，应该是局部麻醉’。我现在不敢多聊天，每一次的对话，都是一个警钟，传达着真的离阿尔茨海默病越来越近……&ensp;&ensp;&ensp;&ensp;写东西这事儿，看来是不能断。上午，溺在阳光里，心情是愉悦的。下午经历个谈话，五点垃圾车音乐想起的时候，大颗的泪珠滚过残疾的左眼，钻心的疼。奶牛说，我是她认识的最多愁善感的人。我承认，我的泪腺确实异常发达。高兴也哭，难过也哭。自己的事哭，别人的事也哭。看到花花草草在险恶的环境中也不由得泛起怜悯之心，想要呵护它们。所以，我喜欢大海。大概是因为它是眼泪的颜色。当然，海特别美。痕痕说过，真正美丽的东西，会使人程度或轻或重的难过。既美又伤感，越美越伤感。海也好，天也好。看不清是海还是天的交界线也好。&ensp;&ensp;&ensp;&ensp;其实，我笑点也很低，尤其喜欢冷笑话，例如电话走着走着挂了。好喜欢这条。最暖心的时候，是狗对着我笑。球球也好，它的朋友也罢。有一次，我和我妈老山散步，一个小狗看见我们就呲牙咧嘴的跑过来了。我问，是不是咱们身上有狗味？我妈从容的说，肯定是，在小狗眼里，咱们和狗没什么区别。瞬间，两条黑线垂下。现在看来，确实是这样。我经常遇到这样的场景：在离我几十米开外的地方，被主人牵住的狗，傻呵呵的咧嘴笑，看着我走过来。羊总说，它们是因为看到同胞了，所以特别开心。爱笑的狗，运气不会太差。就像球球。&ensp;&ensp;&ensp;&ensp;做《下一站》这个网站的初衷是，在喧嚣的闹市中，为自己的心留一个空间。网站名字，来源于小四这一票人的《下一站：那不勒斯》。落落在文中写到自己很久没有做过类似的事情了。我也一样。十年或者更久。我的日记最终下场有两种，一种是为了防止我妈偷看，扔到床底下，从此再也捞不出来，或是撕了烧了，化成灰烬，伴着泪水。从此，就弃文从工，蹲在路边吃饭，听着嗡嗡的冷机的声音，思考着什么时候耳鸣。哪怕是遇到了精彩异常的事，都不会把它们以文字的形式记录下来。懒吧。懒的另外一层是觉得尚无必要。相信会记住的自然会记住。而遗忘的也就让它遗忘，没什么遗憾的。没记住说明一开始它就不重要。其实不想写什么，可是羊特地为我留了一个版块。还总是不停的催稿。那就零散的写些文字，看似碎片，却是我的生活。平淡，却又无比美好。也很拼命。一些人努力是为了让人生看起来无比励志，我努力只想让我的人生看起来自然而然。就像河流一样，自然流淌。下一站在哪里，是森林，大海，山野还是月光。答案交给时光。不过，姑娘，你的愿望还真是美好。 走吧,女孩 去看红色的朝霞 带上我的恋歌 你迎风吟唱 露水挂在发梢 结满透明的惆怅 是我一生最初的迷惘","raw":null,"content":null,"categories":[{"name":"Chaos;Head","slug":"Chaos-Head","permalink":"http://yoursite.com/categories/Chaos-Head/"}],"tags":[]},{"title":"Hacks and Painters摘录","slug":"Hacks and Painters摘录","date":"2016-04-18T15:06:45.000Z","updated":"2016-04-20T11:52:11.000Z","comments":true,"path":"2016/04/19/Hacks and Painters摘录/","link":"","permalink":"http://yoursite.com/2016/04/19/Hacks and Painters摘录/","excerpt":"","keywords":null,"text":"1.为什么书呆子不受欢迎2015-12-21青少年往往很关注服饰。他们这样做并不是有意让自己赢得大众，他们的目的只是要穿得好看。但是穿给谁看呢？无非就是其他小孩。同伴的意见成为他们判别事物的表示标准，这不仅体现在衣着上，还体现在他们做的几乎每一件事情上，就连走路的姿势也不例外。所以，他们为了把所有事情“做对”，所付出的任何努力，不管是有意还是无意，实际上都等同于努力在使自己变得更受欢迎 2.黑客与画家2015-12-21黑客先开发了一个很酷的软件，然后就写一篇论文，介绍这个软件。论文变成了软件成果的展示。这种结合是错误的，常常会产生问题。为了配合论文研究性的主题，你很容易就把工作重点从开发优美的软件转移为开发一些丑陋的东西。2015-12-21黑客搞懂“计算理论”（theory of computation）的必要性，与画家搞懂颜料化学成分的必要性差不多大。2015-12-21你把整个程序想清楚的时间点，应该是在编写代码的同时，而不是在编写代码之前，这与作家、画家和建筑师的做法完全一样。2015-12-21当你排斥差异的时候，你不仅将失败的可能性排除在外，也将获得高利润的可能性排除在外。2015-12-21黑客如何才能做自己喜欢的事情？我认为这个问题的解决方法是一个几乎所有创作者都知道的方法：找一份养家糊口的“白天工作”（day job）。这个词是从音乐家身上来的，他们晚上表演音乐，所以白天可以找一份其他工作。更一般地说，“白天工作”的意思是，你有一份为了赚钱的工作，还有一份为了爱好的工作。2015-12-23你不能盼望先有一个完美的规格设计，然后再动手编程，这样想是不现实的。如果你预先承认规格设计是不完美的，在编程的时候，就可以根据需要当场修改规格，最终会有一个更好的结果。2015-12-23如果黑客只是一个负责实现领导意志的技术工人，职责就是根据规格说明书写出代码，那么他其实与一个挖水沟的工人是一样的，从这头挖到那头，仅此而已。但是，如果黑客是一个创作者，他从事的就不是机械性的工作，他必须具备灵感。2015-12-23对于画家和黑客这样的创作者，有些工作需要投入巨大的热情，另一些工作则是不需要很操心的日常琐事。在你厌倦的时候再去做那些比较容易的工作，这是个不错的主意。2015-12-23这也是多人共同开发一个软件的正确模式。需要合作，但是不要“合”得过头。如果一个代码块由三四个人共同开发，就没有人真正“拥有”这块代码。最终，它就会变得像一个公用杂物间，没人管理，又脏又乱，到处堆满了冗余代码。正确的合作方法是将项目分割成严格定义的模块，每一个模块由一个人明确负责。模块与模块之间的接口经过精心设计，如果可能的话，最好把文档说明写得像编程语言规范那样清晰。 3.不能说的话2015-12-23所谓“时尚”，本质上就是自己看不见自己的样子。 你是一个随大流的人吗2015-12-23如果别人告诉你应该相信什么，你就真的相信了，那么你就会和别人一样犯下同样的错误。如果你是南北战争前的南方庄园主，你会与北方开战；如果你是20世纪30年代的德国人，你会相信希特勒。 真话2015-12-23触怒他人的言论是那些可能会有人相信的言论。我猜想，最令人暴跳如雷的言论，就是被认为说出了真相的言论。 守口如瓶2015-12-231638年，英国诗人弥尔顿（John Milton）准备第一次访问意大利。曾经担任英国驻威尼斯大使的沃顿爵士（Hemy Wootton）告诉弥尔顿要记住一句座右铭“i pensieri stretti &amp; il viso sciolto”。字面意思是“守口如瓶，笑脸相迎” 用户的胜利2015-12-23互联网应用程序能够同时被多人使用，所以非常适合团队协作性的工作。大多数用户现在还不了解软件协同办公，否则估计他们会强烈要求大部分应用程序都具备这个功能。举例来说，允许两个用户同时编辑一个文档是一项很有用的功能。 软件bug2015-12-23“随着软件规模的增大，开发成本指数式上升。这可能是因为修正旧bug的原因。如果bug都能被快速发现，成本的上升形态就能基本保持线性。” 全身心投入2015-12-23客户支持实际上就是质量监控，也是某种程度的市场营销。 逆向的《人月神话》2015-12-23假如某个项目预估需要12个人月，那么派4个人处理这个项目，理论上需要3个月，派6个人则只需要2个月。但是，布鲁克斯认为这种换算机制在软件业行不通，是一个神话，因为软件项目是交互关系复杂的工作，需要大量的沟通成本，人力的增加会使沟通成本急剧上升，反而无法达到缩短工期的目的。在本质上，软件项目的人力与工期是无法互换的，当项目进度落后时，光靠增加人力到该项目中，并不会加快进度，反而有可能使进度更加延后。 金钱问题2015-12-24商业性公司就会采用一种叫做“价格歧视”（price discrimination）的定价方法，也就是针对不同的客户给出不同的报价，使得利润最大化 目标客户2015-12-24如果你想把钱藏在安全的地方，请问你是选择放在家中床垫下面，还是放在银行2015-12-24某种程度上，使用互联网软件的大公司就好像把它的IT部门外包出去了。虽然听起来很激进，但是我认为这样做很好。比起自己雇用系统管理员，外包可以让这些公司得到更好的服务。非IT公司的内部系统管理员没有行业竞争压力，日久天长就会变得工作效率低下、不负责任。要让员工表现优秀，必须有竞争压力。2015-12-24公司内部所有不直接感受到竞争压力的部门都应该外包出去，让它们暴露在竞争压力之下。 微软公司2015-12-24（但是，苹果公司还没有失败，如果它能把iPod升级成手机，并且将网络浏览器包括在其中，那么微软公司就有大麻烦了。）（译者注：这段话写于2001年92015-12-24我预计微软会推出某种服务器和桌面电脑的混合产品，让它的桌面操作系统专门与由它控制的服务器协同工作。至少它也会把文件放在服务器上，需要的用户可以自己去下载。我觉得微软不会把运算都放到服务器端，让客户只要有浏览器就行了，它不会走得那么远","raw":null,"content":null,"categories":[{"name":"Robotics;Notes","slug":"Robotics-Notes","permalink":"http://yoursite.com/categories/Robotics-Notes/"}],"tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"Sakura@Ueno","slug":"Sakura-Ueno","date":"2016-04-14T16:29:18.000Z","updated":"2016-04-20T11:52:26.000Z","comments":true,"path":"2016/04/15/Sakura-Ueno/","link":"","permalink":"http://yoursite.com/2016/04/15/Sakura-Ueno/","excerpt":"","keywords":null,"text":"","raw":null,"content":null,"categories":[{"name":"Steins;Gates","slug":"Steins-Gates","permalink":"http://yoursite.com/categories/Steins-Gates/"}],"tags":[{"name":"樱花","slug":"樱花","permalink":"http://yoursite.com/tags/樱花/"},{"name":"上野","slug":"上野","permalink":"http://yoursite.com/tags/上野/"}]},{"title":"Hello World","slug":"hello-world","date":"2016-04-14T15:37:26.000Z","updated":"2016-04-20T11:52:38.000Z","comments":true,"path":"2016/04/15/hello-world/","link":"","permalink":"http://yoursite.com/2016/04/15/hello-world/","excerpt":"","keywords":null,"text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","raw":null,"content":null,"categories":[{"name":"Robotics;Notes","slug":"Robotics-Notes","permalink":"http://yoursite.com/categories/Robotics-Notes/"}],"tags":[]}]}